{
    "QuestionText": [
        "I can write syntactically correct C/C++ statements.",
        "I understand the language structure of C/C++ and the usage of the reserved words.",
        "I can write logically correct blocks of code using C/C++",
        "I can write a C/C++ program that computes the average of any given number of values.",
        "I can use built-in functions that are available in the various C/C++ libraries.",
        "I can write a small C/C++ program given a small problem that is familiar to me.",
        "I can write a reasonably sized C/C++ program that can solve a problem that is only vaguely familiar to me",
        "I can write a long and complex C/C++ program to solve any given problem as long as the specifications are clearly defined",
        "I can organize and design my program in a modular manner",
        "I understand the object-oriented paradigm",
        "I can identify the objects in the problem domain and declare, define, and use them",
        "I can make use of a pre-written function, given a clearly labeled declaration of the function",
        "I can debug (correct all the errors) a long and complex program that I had written and make it work.",
        "I can comprehend a long, complex multi-file program.",
        "I could complete a programming project if someone showed me how to solve the problem first.",
        "I could complete a programming project if I had only the language reference manual for help",
        "I could complete a programming project if I could call someone for help if I got stuck",
        "I could complete a programming project once someone else helped me get started.",
        "I could complete a programming project if I had a lot of time to complete the program",
        "I could complete a programming project if I had just the built-in help facility for assistance.",
        "I could find ways of overcoming the problem if I got stuck at a point while working on a programming project.",
        "I could come up with a suitable strategy for a given programming project in a short time.",
        "I could manage my time efficiently if I had a pressing deadline on a programming project.",
        "I could mentally trace through the execution of a long, complex, multi-file program given to me",
        "I could rewrite lengthy confusing portions of code to be more readable and clear.",
        "I can find a way to concentrate on my program, even when there were many distractions around me",
        "I can find ways of motivating myself to program, even if the problem area was of no interest to me.",
        "I could write a program that someone else could comprehend and add features to at a later date"
    ]
}